<?php
/**
 * tpshop 微信支付插件
 * ============================================================================
 * 版权所有 2015-2027 深圳搜豹网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.tp-shop.cn
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用 .
 * 不允许对程序代码以任何形式任何目的的再发布。
 * 如果商业用途务必到官方购买正版授权, 以免引起不必要的法律纠纷.
 * ============================================================================
 */

/**
 * 支付 逻辑定义
 * Class
 */

use think\Db;

class meibi
{

    /**
     * 页面跳转响应操作给支付接口方调用
     */
    function respond2()
    {
        $order_sn = $_GET['order_sn'];
        if (Db::name('order')->where(['order_sn' => $order_sn])->find()['pay_status']) {
            return ['status' => 1, 'order_sn' => $order_sn];//跳转至成功页面
        } else {
            return ['status' => 0, 'order_sn' => $order_sn]; //跳转至失败页面
        }
    }
}